descent/stm32f4_prog/load_from_sd/spi_sdcard.c
	// enable clock for used IO pins
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
	
	/* Configure the chip select pin
	   in this case we will use PA4 */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_4;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	GPIOA->BSRRL |= GPIO_Pin_4; // set PA4 high
#if 0
	/* Configure the chip select pin
	   in this case we will use PE7 */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOE, &GPIO_InitStruct);
	
	GPIOE->BSRRL |= GPIO_Pin_7; // set PE7 high
#endif	
	// enable peripheral clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
	
	/* configure SPI1 in Mode 0 
	 * CPOL = 0 --> clock is low when idle
	 * CPHA = 0 --> data is sampled at the first edge
	 */
	SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex; // set to full duplex mode, seperate MOSI and MISO lines
	SPI_InitStruct.SPI_Mode = SPI_Mode_Master;     // transmit in master mode, NSS pin has to be always high
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b; // one packet of data is 8 bits wide
	SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;        // clock is low when idle
	SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;      // data sampled at first edge
	SPI_InitStruct.SPI_NSS = SPI_NSS_Soft | SPI_NSSInternalSoft_Set; // set the NSS management to internal and pull internal NSS high
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // SPI frequency is APB2 frequency / 4
	SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;// data is transmitted MSB first
	SPI_Init(SPI1, &SPI_InitStruct); 
	
	SPI_Cmd(SPI1, ENABLE); // enable SPI1
}



uint8_t SPI1_send(uint8_t data)
{
  SPI1->DR = data; // write data to be transmitted to the SPI data register
  while( !(SPI1->SR & SPI_I2S_FLAG_TXE) ); // wait until transmit complete
  while( !(SPI1->SR & SPI_I2S_FLAG_RXNE) ); // wait until receive complete
  while( SPI1->SR & SPI_I2S_FLAG_BSY ); // wait until SPI is not busy anymore
  return SPI1->DR; // return received data from SPI data register
}

uint8_t xchg_spi (uint8_t dat)
{
  return SPI1_send(dat);
}

char* s32_itoa(uint32_t n, char* str, int radix)
{
  char digit[]="0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
  char* p=str;
  char* head=str;
  uint8_t count=0;
  //int radix = 10;

//  if(!p || radix < 2 || radix > 36)
//    return p;
  if (n==0)
  {
    *p++='0';
    *p++ = '0';
    *p=0;
    return str;
  }
  if (radix == 10 && n < 0)
  {
    *p++='-';
    n= -n;
  }

  while(n)
  {
    ++count;
    *p++=digit[n%radix];
    //s32_put_char(*(p-1), (u8*)(0xb8000+80*2));
    n/=radix;
  }
  if (count == 1)
    *p++ = '0';

  *p=0;
  #if 1
  for (--p; head < p ; ++head, --p)
  {
    char temp=*head;
    if (*(p-1) != '-')
    {
      *head=*p;
      *p=temp;
    }
  }
  #endif
  return str;
}

#define BUF_SIZE 256

void s32_memcpy(u8 *dest, const u8 *src, u32 n)
{
  for (int i=0; i < n ; ++i)
    *dest++ = *src++;
}
/**
 * @brief  Main program.
 * @param  None
 * @retval None
 */
int main(void)
{

#ifdef SET_CPU_CLOCK
  SystemInit();
#endif
  uint8_t received_val = 0;
  init_usart(115200);
  ur_puts(USART2, "Init complete! Hello World!\r\n");

  ur_puts(USART2, "Init sd\r\n");
  while(SD_Initialize())//檢測不到SD卡
  {
    delay(0x3fffff);
    ur_puts(USART2, "Init sd again\r\n");
  }

  ur_puts(USART2, "Init sd ok\r\n");
  char str[20]={0};
  #if 0
  s32_itoa(2, str, 16);
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");
  while(1);
  #endif

  static u8 cid[16];
  u8 ret = SD_GetCID(cid);
  if (ret == 0)
  {
    ur_puts(USART2, "get cid ok\r\n");
  }
  else
  {
    ur_puts(USART2, "get cid fail\r\n");
  }

#if 1
  ur_puts(USART2, "cid:\r\n");
  for (int i=0 ; i < 16 ; ++i)
  {
    s32_itoa(cid[i], str, 16);
    ur_puts(USART2, str);
  }
  ur_puts(USART2, "\r\n");
#endif
  char pnm[10]="";
  pnm[0] = cid[1];
  pnm[1] = cid[2];
  pnm[2] = 0;
    ur_puts(USART2, "oid: ");
    ur_puts(USART2, pnm);
    ur_puts(USART2, "\r\n");
  pnm[0] = cid[3];
  pnm[1] = cid[4];
  pnm[2] = cid[5];
  pnm[3] = cid[6];
  pnm[4] = cid[7];
  pnm[5] = 0;
    ur_puts(USART2, "pnm: ");
    ur_puts(USART2, pnm);
    ur_puts(USART2, "\r\n");

  ret = SD_GetCSD(cid);
  if (ret == 0)
  {
    ur_puts(USART2, "get csd ok\r\n");
  }
  else
  {
    ur_puts(USART2, "get csd fail\r\n");
  }
  ur_puts(USART2, "csd:\r\n");
  for (int i=0 ; i < 16 ; ++i)
  {
    s32_itoa(cid[i], str, 16);
    ur_puts(USART2, str);
  }
  ur_puts(USART2, "\r\n");

  u32 sd_size = SD_GetSectorCount(); //得到 sector count

  s32_itoa(sd_size, str, 10);
  ur_puts(USART2, "sd_size: ");
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

  __attribute__((section(".ccm")))
  static u8 buf[512];

  u32 sec = 0;
  if(SD_ReadDisk(buf, sec, 1) == 0)   //讀取0扇區的內容
  {               
    ur_puts(USART2, "dump sector 0: \r\n");
    for (int i=0 ; i < 512; ++i)
    {
      if (i%16 == 0)
        ur_puts(USART2, "\r\n");
      s32_itoa(buf[i], str, 16);
      ur_puts(USART2, str);
      ur_puts(USART2, " ");
    }
  }

  u32 total,free;
  exfuns_init(); // 配置 fatfs 相關變數所使用的記憶體
  if (FR_INVALID_DRIVE == f_mount(fs[0],"0:",1)) 
  {
    ur_puts(USART2, "f_mount fail\r\n");
    return -1;
  }

  while(exf_getfree("0:",&total,&free))    //得到SD卡的總容量和剩餘容量
  {
  }
  //printf("total: %d, free: %d\n", total, free);

  ur_puts(USART2, "\r\ntotal: ");
  s32_itoa(total, str, 10);
  ur_puts(USART2, str);

  ur_puts(USART2, ", free: ");
  s32_itoa(free, str, 10);
  ur_puts(USART2, str);
  ur_puts(USART2, "\r\n");

#if 1
{
  u8 *elf_code = 0;

  FIL fil;       /* File object */
  char buf[BUF_SIZE]; /* Line buffer */
  FRESULT fr;    /* FatFs return code */
  //fr = f_open(&fil, "1.txt", FA_READ);
  //const char *fn = "2:/MYUR_1~1.ELF";
  const char *fn = "0:/myur_168M.elf";
  fr = f_open(&fil, fn, FA_READ);
  if (fr) 
  {
    //printf("open %s fail\n", fn);
    return (int)fr;
  }

