descent/stm32f4_prog/load_from_sd/spi_sdcard.c
  TCHAR* pos=0;
  DWORD fsize = f_size (&fil);
  //printf("fsize: %d\n", fsize);
  int r_len = 0;
  while (1)
  {
    f_read(&fil, buf, BUF_SIZE, &r_len);
    //printf("r_len: %d\n", r_len);
    fsize -= BUF_SIZE;
#if 0
    if (fsize < BUF_SIZE)
      print_packet(buf, fsize);
    else
      print_packet(buf, BUF_SIZE);
#endif
    Elf32Ehdr elf_header = *((Elf32Ehdr*)buf);
    #if 0
    printf("sizeof Elf32Ehdr: %d\n", sizeof(Elf32Ehdr));
    printf("sizeof Elf32Phdr: %d\n", sizeof(Elf32Phdr));
    printf("elf_header.e_phoff: %d\n",  elf_header.e_phoff);
    #endif
    u32 entry = elf_header.e_entry; 
    if (elf_header.e_phoff > BUF_SIZE)
    {
      //printf("error elf_header.e_phoff > BUF_SIZE!!\n");
      break;
    }
    Elf32Phdr elf_pheader = *((Elf32Phdr*)((u8 *)buf + elf_header.e_phoff)); // program header
    //printf("elf_header.e_phnum: %d\n", elf_header.e_phnum);
    for (int i=0 ; i < elf_header.e_phnum; ++i)
    {
      int ret;
      //printf("p_vaddr: %#x offset: %#x size: %d\n", elf_pheader.p_vaddr, elf_pheader.p_offset, elf_pheader.p_filesz);
      ret = f_lseek(&fil, elf_pheader.p_offset);

      u32 read_times =  1;
      if (elf_pheader.p_filesz > BUF_SIZE)
      {
      #if 0
        printf("elf_pheader.p_filesz: %d\n", elf_pheader.p_filesz);
        printf("BUF_SIZE: %d\n", BUF_SIZE);
        printf("elf_pheader.p_filesz > BUF_SIZE need to read %d times.\n", read_times);
      #endif
        read_times = elf_pheader.p_filesz/BUF_SIZE;
        if ( elf_pheader.p_filesz % BUF_SIZE != 0)
          ++read_times;
      }

      for (int i=0 ; i < read_times; ++i)
      {
        u32 read_len = BUF_SIZE;
        if (i == (read_times-1))
        {
          read_len = elf_pheader.p_filesz - i * BUF_SIZE;
        }
        f_read(&fil, buf, read_len, &r_len);
        s32_memcpy(elf_pheader.p_vaddr + read_len * i, buf, r_len);
        (*(void(*)())entry)();
        ur_puts(USART2, "back to loader\r\n");
        while(1);
        //printf("yy r_len: %d\n", r_len);
        //print_packet(buf, r_len);
      }

#if 0
      if (elf_pheader.p_filesz > BUF_SIZE)
      {
        //printf("can not read: elf_pheader.p_filesz > BUF_SIZE\n");
      }
      else
      {
        f_read(&fil, buf, elf_pheader.p_filesz, &r_len);
        //printf("yy r_len: %d\n", r_len);
        //print_packet(buf, r_len);
        #if 1
        s32_memcpy(elf_pheader.p_vaddr, buf, r_len);
        (*(void(*)())entry)();
        ur_puts(USART2, "back\r\n");
        while(1);
        #endif
      }
#endif
    }
    break;

    // printf(line);
  }

  /* Close the file */
  f_close(&fil);
}
#endif

#if 0

  u8 byte,data,multi,blk_len;
  u32 c_size;
  u32 capacity=0;

		blk_len = 0x0F & cid[6]; // this should equal 9 -> 512 bytes
		/*	; get size into reg 
			;	  7				8			9
			; xxxx xxxx    xxxx xxxx    xxxx xxxx
			;        ^^    ^^^^ ^^^^    ^^ 
		*/
		data =(cid[7] & 0x03)<<6;
		data |= (cid[8] >> 2);
		c_size = data << 4;
		data =(cid[8] << 2 ) | ((cid[9] & 0xC0)>>6 );
		c_size |= data;
		
		/*	; get multiplier
			;	10			11
			; xxxx xxxx    xxxx xxxx
			;        ^^    ^
		*/
		multi = ((cid[10] & 0x03 ) << 1 ) ;
		multi |= ((cid[11] & 0x80) >> 7);
		// sectors = (size+1)<<(multiplier+2)
		capacity = (c_size + 1)<<(multi + blk_len + 2);

  s32_itoa(capacity, str, 16);
    ur_puts(USART2, "hex:\r\n");
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");

  s32_itoa(capacity, str, 10);
    ur_puts(USART2, "dec:\r\n");
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");
#endif

  while(1);
#if 0
  while(1)
  {
    //GPIOE->BSRRH |= GPIO_Pin_7; // set PE7 (CS) low
    GPIOA->BSRRH |= GPIO_Pin_4; // set PE7 (CS) low
    #if 1
    SPI1_send(0xAA);  // transmit data
    received_val = SPI1_send(0x12); // transmit dummy byte and receive data
    #endif
    //GPIOE->BSRRL |= GPIO_Pin_7; // set PE7 (CS) high
    GPIOA->BSRRL |= GPIO_Pin_4; // set PE7 (CS) high
  }
#endif

}

